In [46]:
import pandas as pd
import numpy as np

## How to create Pandas DataFream

In [2]:
# This code is created Empty dataframe
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

## insert the some data value in a dataframe

In [3]:
 # Non-square DataFrame with mixed dtypes
df2=pd.DataFrame({'Name':["kanha",'Billu','Harijander','Dinesh'],
            'Roll No':[1122,1123,1124,1125],
            'Greade':[1,2,3,'2A'],
            'Total Marks':[40,45,49,46]})

In [4]:
# df2 = pd.DataFrame(data=df2)

In [5]:
df2

         Name  Roll No Greade  Total Marks
0       kanha     1122      1           40
1       Billu     1123      2           45
2  Harijander     1124      3           49
3      Dinesh     1125     2A           46

In [6]:
df2.head(3)  # Top element will show this command

         Name  Roll No Greade  Total Marks
0       kanha     1122      1           40
1       Billu     1123      2           45
2  Harijander     1124      3           49

In [7]:
df2.tail(3)  # Bottom data elements will show this command

         Name  Roll No Greade  Total Marks
1       Billu     1123      2           45
2  Harijander     1124      3           49
3      Dinesh     1125     2A           46

In [8]:
df2.dtypes # Witch type of data in DF

Name           object
Roll No         int64
Greade         object
Total Marks     int64
dtype: object

In [9]:
df2.shape

(4, 4)

In [1]:
# Python program using Pandas for  
# arranging a given set of data  
# into a  table 
  
# importing pandas as pd 
import pandas as pd 
  
data = {"country": ["Brazil", "Russia", "India", "China", "South Africa"], 
       "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"], 
       "area": [8.516, 17.10, 3.286, 9.597, 1.221], 
       "population": [200.4, 143.5, 1252, 1357, 52.98] } 
  
data_table = pd.DataFrame(data) 
print(data_table)

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [10]:
df3=pd.DataFrame([[1,2,3,4],
                  [5,6,7,8,9],
                  [10,11,12,13],
                  [14,15,16,17]])

In [11]:
df3

    0   1   2   3    4
0   1   2   3   4  NaN
1   5   6   7   8  9.0
2  10  11  12  13  NaN
3  14  15  16  17  NaN

In [12]:
df3.shape

(4, 5)

In [13]:
df3.iloc[0,1]

2

In [14]:
df3.iloc[0:2,1:3]

   1  2
0  2  3
1  6  7

In [15]:
dates = pd.date_range('20190101', periods=12)

In [16]:
dates

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [17]:
print(pd.__version__)

0.25.3

In [18]:
arr=[0,1,2,3,4,5]
s=pd.Series(arr)
s

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [19]:
order=[1,2,3,4,5,6]
s1=pd.Series(arr,index=order)
s1

1    0
2    1
3    2
4    3
5    4
6    5
dtype: int64

In [20]:
import numpy as np
n= np.random.randn(5) # create a random Nd array
index=['a','b','c','d','e']
s1=pd.Series(n,index=index)
s1

a   -1.803823
b    0.991995
c   -0.181050
d   -0.974533
e   -2.578895
dtype: float64

In [21]:
d={'a':1,'b':2,'c':3,'d':4,'e':5,'f':7}
s2=pd.Series(d)
s2

a    1
b    2
c    3
d    4
e    5
f    7
dtype: int64

In [22]:
# you can modify the index of series
print(s)
s1.index
s1

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

a   -1.803823
b    0.991995
c   -0.181050
d   -0.974533
e   -2.578895
dtype: float64

In [23]:
index=['a','b','c','d','e']
s=pd.Series(index)
s

0    a
1    b
2    c
3    d
4    e
dtype: object

In [24]:
type(s)

pandas.core.series.Series

In [25]:
empty=pd.Series([])
empty

Series([], dtype: float64)

In [30]:
# s=pd.Series([1,2,3,4,5],v=['a','b','c','d','e'],dtype=float)
# print(s)

In [31]:
scalar=pd.Series(0.5)
scalar

0    0.5
dtype: float64

In [32]:
scalar=pd.Series(0.5, index = [1,2,3])
scalar

1    0.5
2    0.5
3    0.5
dtype: float64

In [33]:
dict_scalar=pd.Series({'a':1,'b':9})
dict_scalar

a    1
b    9
dtype: int64

In [34]:
s4=pd.Series([1,2,3,4,5,6])
s4

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [35]:
s4[4] # access value by number of index

5

In [36]:
s4[2]

3

In [37]:
# slicing
s4[0:3]

0    1
1    2
2    3
dtype: int64

In [38]:
max(s4)

6

In [39]:
min(s4)

1

In [40]:
s4[s4>3]

3    4
4    5
5    6
dtype: int64

In [41]:
s4

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [42]:
s5=pd.Series([1,2,3,4,5,6])
s4+s5  # sum of two series

0     2
1     4
2     6
3     8
4    10
5    12
dtype: int64

In [45]:
s6=pd.Series([1,2,3,4])
s5+s6

0    2.0
1    4.0
2    6.0
3    8.0
4    NaN
5    NaN
dtype: float64

<class 'str'>